Feature: Video Game Sales Example

  Scenario: Find the most frequent game consoles in the database
    Given graph "vg_sales"
    When executing query:
            """
            MATCH (g:Game)-[:Sold]->(c:Console)
            RETURN c.name as Console, COUNT(g) AS NumGames
            ORDER BY NumGames DESC
            LIMIT 10;
            """
    Then the result should be:
            | Console  | NumGames |
            | 'PS2'      | 1210     |
            | 'PS3'      | 799      |
            | 'X360'     | 768      |
            | 'DS'       | 717      |
            | 'PS'       | 696      |
            | 'Wii'      | 662      |
            | 'GBA'      | 377      |
            | 'PSP'      | 364      |
            | 'XB'       | 336      |
            | 'GC'       | 232      |


  Scenario: Find a Pokemon franchise, sort them by age and rating if available
    Given graph "vg_sales"
    When executing query:
            """
            MATCH (g:Game)
            WITH g.name AS name, g.year as year, g.critic_score as score
            WHERE toupper(name) CONTAINS  'POKEMON'
            RETURN name AS GameName, year AS Year, ROUND(score) AS CriticScore
            ORDER BY year, score
            LIMIT 10;
            """
    Then the result should be:
            | GameName                                | Year                                  | CriticScore                           |
            | 'Pokemon Red/Pokemon Blue'              | 1996                                  | null                                  |
            | 'Pokemon Stadium'                       | 1999                                  | null                                  |
            | 'Pokemon Snap'                          | 1999                                  | null                                  |
            | 'Pokemon Gold/Pokemon Silver'           | 1999                                  | null                                  |
            | 'Pokemon Pinball'                       | 1999                                  | null                                  |
            | 'Pokemon Puzzle League'                 | 2000                                  | null                                  |
            | 'Pokemon Card GB2: Here Comes Team GR!' | 2001                                  | null                                  |
            | 'Pokemon Ruby/Pokemon Sapphire'         | 2002                                  | null                                  |
            | 'Pokemon Channel'                       | 2003                                  | 55.0                                  |
            | 'Pokemon Box: Ruby & Sapphire'          | 2003                                  | null                                  |


  Scenario: Add attribute game.TOT and order games by newly constructed argument
    Given graph "vg_sales"
    When executing query:
            """
            MATCH (g:Game)-[s:Sold]-(c:Console)
            WITH g AS game, ROUND(SUM(s.EU + s.NA +s.JP + s.OT) * 100) / 100 AS soldUnits
            SET game.TOT = soldUnits
            RETURN game.name AS Name, game.TOT AS SoldUnits
            ORDER BY SoldUnits DESC
            LIMIT 10;
            """
    Then the result should be:
          | Name                             | SoldUnits                      |
          | 'Wii Sports '                    | 82.54                          |
          | 'Grand Theft Auto V'             | 56.58                          |
          | 'Super Mario Bros.'              | 45.31                          |
          | 'Tetris'                         | 35.84                          |
          | 'Mario Kart Wii'                 | 35.52                          |
          | 'Wii Sports Resort'              | 32.77                          |
          | 'Pokemon Red/Pokemon Blue'       | 31.38                          |
          | 'Call of Duty: Modern Warfare 3' | 30.6                           |
          | 'New Super Mario Bros.'          | 29.8                           |
          | 'Call of Duty: Black Ops II'     | 29.4                           |


  Scenario: Find publishers that published only on single console
    Given graph "vg_sales"
    When executing query:
            """
            MATCH (c:Console)<-[s:Sold]-(g:Game)-[:PublishedBy]->(p:Publisher)
            WHERE p.name IS NOT NULL
            WITH p, COLLECT(c.name) AS consoles, SUM(g.TOT) AS total
            WHERE SIZE(consoles) = 1
            UNWIND consoles AS c
            RETURN p.name AS PublisherName, total AS TotalSales, c AS ConsoleName
            ORDER BY total DESC
            LIMIT 10;
            """
    Then the result should be:
            | PublisherName      | TotalSales       | ConsoleName       |
            | 'JVC'              | 2.41             | 'PS'               |
            | 'NCSoft'           | 2.3              | 'PC'               |
            | 'UEP Systems'      | 2.26             | 'PS'               |
            | 'Hello Games'      | 1.69             | 'PS4'              |
            | 'Westwood Studios' | 1.55             | 'PC'               |
            | 'Alchemist'        | 1.21             | 'PS2'              |
            | 'Russel'           | 1.12             | 'PC'               |
            | 'Genki'            | 0.92             | 'PS2'              |
            | 'TalonSoft'        | 0.88             | 'PS'               |
            | 'CTO SpA'          | 0.88             | 'PS'               |



  Scenario: Find sales across different years, print games sold in that year descending by number of sold units
    Given graph "vg_sales"
    When executing query:
            """
            MATCH (g:Game)
            WITH  g, g.TOT AS total
            ORDER BY total DESC
            WITH g.year AS year, COLLECT(g) AS games, ROUND(SUM(total)* 100) / 100 as yearSale
            ORDER BY year
            RETURN year AS Year, EXTRACT(game in games | {game: game.name, sale: game.TOT}) as GameSales, yearSale AS TotalYearSale
            LIMIT 5;
            """
    Then the result should be:
            | Year                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                           | GameSales                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                      | TotalYearSale                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  |
            | 1980                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                           | [{game: 'Asteroids', sale: 5.45}, {game: 'Missile Command', sale: 3.21}, {game: 'Ice Hockey', sale: 2.92}, {game: 'Defender', sale: 1.45}, {game: 'Kaboom!', sale: 1.15}, {game: 'Boxing', sale: 0.77}, {game: 'Freeway', sale: 0.34}, {game: 'Bridge', sale: 0.27}, {game: 'Checkers', sale: 0.23}]                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                           | 15.79                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          |
            | 1981                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                           | [{game: 'Frogger', sale: 6.37}, {game: 'Donkey Kong', sale: 5.67}, {game: 'Spider-Man', sale: 4.59}, {game: 'Pitfall!', sale: 4.5}, {game: 'Demon Attack', sale: 2.13}, {game: 'Centipede', sale: 2}, {game: 'E.T.: The Extra Terrestrial', sale: 1.97}, {game: 'Ms. Pac-Man', sale: 1.66}, {game: 'River Raid', sale: 1.6}, {game: 'Atlantis', sale: 1.27}, {game: 'Megamania', sale: 1.1}, {game: 'Cosmic Ark', sale: 1.05}, {game: 'Donkey Kong Junior', sale: 0.96}, {game: 'Custer's Revenge', sale: 0.82}, {game: 'Alien', sale: 0.79}, {game: 'Air Raid', sale: 0.77}, {game: 'Berzerk', sale: 0.73}, {game: 'King Kong', sale: 0.7}, {game: 'Adventures of Tron', sale: 0.67}, {game: 'BurgerTime', sale: 0.59}, {game: 'Smurf: Rescue In Gargamel's Castle', sale: 0.59}, {game: 'Raiders of the Lost Ark', sale: 0.5}, {game: 'Grand Prix', sale: 0.48}, {game: 'Jawbreaker', sale: 0.45}, {game: 'Phoenix', sale: 0.44}, {game: 'Barnstorming', sale: 0.42}, {game: 'Mouse Trap', sale: 0.4}, {game: 'Laser Blast', sale: 0.39}, {game: 'Airlock', sale: 0.38}, {game: 'Dragonfire', sale: 0.37}, {game: 'Frogs And Flies', sale: 0.35}, {game: 'Carnival', sale: 0.34}, {game: 'Fantastic Voyage', sale: 0.34}, {game: 'Fireball', sale: 0.32}, {game: 'Astroblast', sale: 0.31}, {game: 'Fast Food', sale: 0.29}, {game: 'RealSports Football', sale: 0.25}, {game: 'Front Line', sale: 0.23}, {game: 'Dark Cavern', sale: 0.23}, {game: 'Crazy Climber', sale: 0.22}, {game: 'Reactor', sale: 0.22}, {game: 'Deadly Duck', sale: 0.22}, {game: 'RealSports Baseball', sale: 0.21}, {game: 'International Soccer', sale: 0.19}] | 48.08                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          |
            | 1982                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                           | [{game: 'Pac-Man', sale: 9.03}, {game: 'Mario Bros.', sale: 3.87}, {game: 'Dig Dug', sale: 2.05}, {game: 'Popeye', sale: 1.64}, {game: 'Q*bert', sale: 1.42}, {game: 'Pole Position', sale: 1.18}, {game: 'Moon Patrol', sale: 1.12}, {game: 'Jungle Hunt', sale: 1.1}, {game: 'Joust', sale: 1.08}, {game: 'Enduro', sale: 0.87}, {game: 'Yars' Revenge', sale: 0.78}, {game: 'Galaxian', sale: 0.78}, {game: 'Kangaroo', sale: 0.72}, {game: 'Keystone Kapers', sale: 0.67}, {game: 'X-Man', sale: 0.63}, {game: 'Halloween', sale: 0.62}, {game: 'Battlezone', sale: 0.62}, {game: 'The Activision Decathlon', sale: 0.56}, {game: 'Action Force', sale: 0.54}, {game: 'Chopper Command', sale: 0.51}, {game: 'RealSports Tennis', sale: 0.5}, {game: 'Gauntlet', sale: 0.5}, {game: 'Congo Bongo', sale: 0.39}, {game: 'Bump 'n' Jump', sale: 0.39}, {game: 'Gravitar', sale: 0.37}, {game: 'Alien's Return', sale: 0.34}, {game: 'Bank Heist', sale: 0.34}, {game: 'Frankenstein's Monster', sale: 0.32}, {game: 'Mountain King', sale: 0.31}, {game: 'Polaris', sale: 0.28}, {game: 'Mr. Do!', sale: 0.28}, {game: 'Porky's', sale: 0.24}, {game: 'Assault', sale: 0.22}]                                                                                                                                                                                                                                                                                                                                                                                                                                                          | 34.27                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          |
            | 1983                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                           | [{game: 'Baseball', sale: 4.81}, {game: 'Mahjong', sale: 2.14}, {game: 'Pitfall II: Lost Caverns', sale: 1.31}, {game: 'Donkey Kong Jr.', sale: 1.11}, {game: 'Jr. Pac-Man', sale: 0.78}, {game: 'Crystal Castles', sale: 0.77}, {game: 'Midnight Magic', sale: 0.51}, {game: 'Millipede', sale: 0.49}, {game: 'Gremlins', sale: 0.46}, {game: 'Pengo', sale: 0.4}, {game: 'Frostbite', sale: 0.34}, {game: 'Frogger II: Threeedeep!', sale: 0.33}, {game: 'Dolphin', sale: 0.29}]                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                             | 13.74                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          |
            | 1984                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                           | [{game: 'Duck Hunt', sale: 28.31}, {game: 'Golf', sale: 6.12}, {game: 'Tennis', sale: 4.16}, {game: 'Excitebike', sale: 4.16}, {game: 'Pinball', sale: 1.85}, {game: 'F1 Race', sale: 1.52}, {game: 'Xevious', sale: 1.52}, {game: '4 Nin uchi Mahjong', sale: 1.45}, {game: 'Hogan's Alley', sale: 1.27}, {game: 'Lode Runner', sale: 1.1}, {game: 'Clu Clu Land', sale: 0.82}, {game: 'Mappy', sale: 0.69}, {game: 'Beamrider', sale: 0.27}]                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                | 53.24                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          |


  Scenario: Find developers by largest critic score, and list their games
    Given graph "vg_sales"
    When executing query:
            """
            MATCH (g:Game)-[:DevelopedBy]->(d:Developer)
            WHERE g.critic_score IS NOT NULL
            WITH d.name AS Developer, AVG(g.critic_score) AS Score, COUNT(g) AS GamesCount, COLLECT(g.name) AS DevelopedGames
            ORDER BY Developer
            WHERE GamesCount >= 2
            RETURN Developer, ROUND(Score * 100) / 100 AS Score, DevelopedGames
            ORDER BY Score DESC
            LIMIT 5;
            """
    Then the result should be:
            | Developer                                                                                                                | Score                                                                                                                    | DevelopedGames                                                                                                           |
            | 'Bungie Software'                                                                                                          | 93.67                                                                                                                    | ['Halo 2', 'Halo 2 Multiplayer Map Pack', 'Halo: Combat Evolved']                                                        |
            | 'Rockstar North'                                                                                                           | 92.2                                                                                                                     | ['Grand Theft Auto IV', 'Grand Theft Auto V', 'Grand Theft Auto: San Andreas', 'Grand Theft Auto: Vice City', 'Manhunt'] |
            | 'Bethesda Game Studios'                                                                                                    | 92.0                                                                                                                       | ['Fallout 3', 'Fallout 4', 'The Elder Scrolls V: Skyrim']                                                                |
            | 'Psygnosis'                                                                                                                | 91.0                                                                                                                       | ['Colony Wars', 'WipEout 3', 'WipEout XL']                                                                               |
            | 'Valve Software'                                                                                                           | 91.0                                                                                                                       | ['Counter-Strike', 'Half-Life', 'Half-Life 2', 'Left 4 Dead 2', 'Portal 2', 'The Orange Box']                            |

  Scenario: Find games that are mostly sold in Japan
    Given graph "vg_sales"
    When executing query:
            """
            MATCH (g:Game)-[s:Sold]->(:Console)
            WITH g AS game, SUM(s.JP) AS jp_sales, SUM(s.NA + s.EU + s.OT) AS other_sales
            WITH game, jp_sales - other_sales AS sales_difference, jp_sales, other_sales
            WHERE sales_difference > 0
            RETURN game.name AS GameName, ROUND(sales_difference * 100) / 100 AS SaleDifference ,ROUND(jp_sales* 100) / 100  AS JapanSales, ROUND(other_sales* 100) / 100  AS OtherSales
            ORDER BY sales_difference DESC
            LIMIT 10;
            """
    Then the result should be:
            | GameName                             | SaleDifference                       | JapanSales                           | OtherSales                           |
            | 'Dragon Quest VII: Warriors of Eden'   | 4.88                                 | 5.4                                  | 0.52                                 |
            | 'Monster Hunter Freedom 3'             | 4.87                                 | 4.87                                 | 0.0                                    |
            | 'Dragon Warrior III'                   | 4.48                                 | 4.58                                 | 0.1                                  |
            | 'Dragon Quest V: Tenkuu no Hanayome'   | 4.42                                 | 4.43                                 | 0.01                                 |
            | 'Friend Collection'                    | 3.67                                 | 3.67                                 | 0.0                                    |
            | 'Monster Hunter 4'                     | 3.44                                 | 3.44                                 | 0.0                                    |
            | 'Dragon Quest VI: Maboroshi no Daichi' | 3.19                                 | 3.19                                 | 0.0                                    |
            | 'Final Fantasy III'                    | 3.1                                  | 5.01                                 | 1.91                                 |
            | 'Yokai Watch 2 Ganso/Honke'            | 3.08                                 | 3.18                                 | 0.1                                  |
            | 'Dragon Warrior IV'                    | 2.94                                 | 3.03                                 | 0.09                                 |


  Scenario: Find developers that had increase of sales in each of subsequent games
    Given graph "vg_sales"
    When executing query:
            """
            MATCH (c:Console)<-[s:Sold]-(g:Game)
            WITH  g as game, g.TOT AS sale
            ORDER BY game.year ASC
            MATCH (game)-[:DevelopedBy]->(d:Developer)
            WITH d as developer, COLLECT(game.name) AS games, COLLECT(sale) AS sales
            WHERE SIZE(games) >= 3
            WITH developer, games, sales, EXTRACT(i IN RANGE(1, SIZE(games) - 1) | sales[i] - sales[i-1]) AS difference
            WHERE ALL(diff IN difference WHERE diff > 0)
            RETURN developer.name AS Developer, games AS Games, sales AS Sales;
            """
    Then the result should be:
          | Developer                                                                                                      | Games                                                                                                          | Sales                                                                                                          |
          | 'Tantalus Interactive'                                                                                           | ['Looney Tunes: Space Race', 'Unreal II: The Awakening', 'Pony Friends 2']                                     | [0.21, 0.22, 0.33]                                                                                             |
          | 'VIS Entertainment'                                                                                              | ['The Powerpuff Girls: Chemical X-Traction', 'The Powerpuff Girls: Relish Rampage', 'State of Emergency']      | [0.26, 0.45, 1.75]                                                                                             |
          | 'Haemimont'                                                                                                      | ['Tropico 3', 'Tropico 4', 'Tropico 5']                                                                        | [0.21, 0.27, 0.32]                                                                                             |
          | 'Ambrella'                                                                                                       | ['Pokemon Channel', 'Pokemon Dash', 'Pokemon Rumble Blast']                                                    | [0.38, 0.77, 1.15]                                                                                             |
          | 'Eighting'                                                                                                       | ['InuYasha: Feudal Combat', 'Naruto: Clash of Ninja Revolution 2', 'Tatsunoko vs. Capcom: Ultimate All-Stars'] | [0.26, 0.39, 0.53]                                                                                             |
